const BLOG_FILES = [
  {
    "type": "folder",
    "name": "ㅁㅁㅁㅁ",
    "path": "ㅁㅁㅁㅁ",
    "children": [
      {
        "type": "file",
        "name": "ㅂ213ㅈㄷㅂㅈㄷ - 복사본",
        "path": "ㅁㅁㅁㅁ/ㅂ213ㅈㄷㅂㅈㄷ - 복사본.md",
        "date": "2026.03.11",
        "content": "안녕하세요 반갑습니다 오늘은 무엇을 하고 지낼 수 있을까요?"
      }
    ]
  },
  {
    "type": "folder",
    "name": "ㅈㅂ",
    "path": "ㅈㅂ",
    "children": [
      {
        "type": "file",
        "name": "새 파일",
        "path": "ㅈㅂ/새 파일.md",
        "date": "2026.03.12",
        "content": "이것은 테스트 입니다,\n# 이것은 테스트 입니다.\n ```\n 이것은 테스트 입니다.\n \n ```\n[[테스트2]]"
      }
    ]
  },
  {
    "type": "folder",
    "name": "폴더 1",
    "path": "폴더 1",
    "children": [
      {
        "type": "file",
        "name": "21",
        "path": "폴더 1/21.md",
        "date": "2026.03.11",
        "content": "안녕하세요 반갑습니다 오늘은 무엇을 하고 지낼 수 있을까요?"
      },
      {
        "type": "file",
        "name": "ㅅ1",
        "path": "폴더 1/ㅅ1.md",
        "date": "2026.03.11",
        "content": "안녕하세요 반갑습니다 오늘은 무엇을 하고 지낼 수 있을까요?"
      }
    ]
  },
  {
    "type": "file",
    "name": "ㅂ213ㅈㄷㅂㅈㄷ - 복사본 - 복사본 (2)",
    "path": "ㅂ213ㅈㄷㅂㅈㄷ - 복사본 - 복사본 (2).md",
    "date": "2026.03.11",
    "content": "안녕하세요 반갑습니다 오늘은 무엇을 하고 지낼 수 있을까요?"
  },
  {
    "type": "file",
    "name": "ㅂ213ㅈㄷㅂㅈㄷ - 복사본 - 복사본",
    "path": "ㅂ213ㅈㄷㅂㅈㄷ - 복사본 - 복사본.md",
    "date": "2026.03.11",
    "content": "안녕하세요 반갑습니다 오늘은 무엇을 하고 지낼 수 있을까요?"
  },
  {
    "type": "file",
    "name": "ㅂ213ㅈㄷㅂㅈㄷ - 복사본",
    "path": "ㅂ213ㅈㄷㅂㅈㄷ - 복사본.md",
    "date": "2026.03.11",
    "content": "안녕하세요 반갑습니다 오늘은 무엇을 하고 지낼 수 있을까요?"
  },
  {
    "type": "file",
    "name": "ㅂ213ㅈㄷㅂㅈㄷ",
    "path": "ㅂ213ㅈㄷㅂㅈㄷ.md",
    "date": "2026.03.11",
    "content": "안녕하세요 반갑습니다 오늘은 무엇을 하고 지낼 수 있을까요?"
  },
  {
    "type": "file",
    "name": "테스트2",
    "path": "테스트2.md",
    "date": "2026.03.12",
    "content": ""
  }
];
