const BLOG_FILES = [
  {
    "type": "folder",
    "name": "Diary",
    "path": "Diary",
    "children": [
      {
        "type": "file",
        "name": "점심 산책길",
        "path": "Diary/점심 산책길.md",
        "date": "2026.03.13",
        "content": "오늘 점심을 먹고 김프로님이 산책을 한다길래 따라 갔다, 이제 날씨도 따뜻해지고 소화도 할겸 같이 걷자고 했다. 최근에 이집트 출장 가서 있었던 일, 주식이야기, 가족의 건강 이야기 등을 하면서 걸었다.\n\n"
      },
      {
        "type": "file",
        "name": "정말로 비전공자가 코딩 할 수 있는 세상이 되었다.",
        "path": "Diary/정말로 비전공자가 코딩 할 수 있는 세상이 되었다..md",
        "date": "2026.03.12",
        "content": "AI만 등에 업으면 뭐든지 할 수 있을 것 같다.\n블로그도 이렇게 원하는 대로 뚝딱 만들어준다.\n이제 뭐 방법을 모른다, 이런 변명은 통하지 않을 것 같다.\n\n진짜 내가 원하는 대로 만들 수 있는 블로그라니~\n인터넷은 점점 AI 쓰레기통이 되어가고 있다.\n\n인터넷이라는 드넓은 세계에 나만의 공간이 생긴 것 같다.\n\n공부 해야지..."
      }
    ]
  }
];
