const BLOG_FILES = [
  {
    "type": "folder",
    "name": "01. Diary",
    "path": "01. Diary",
    "children": [
      {
        "type": "file",
        "name": "주말 끝",
        "path": "01. Diary/주말 끝.md",
        "date": "2026.03.15",
        "content": "## 와우 (World of Warcraft)\n\n확장팩이 열린 지 어느덧 2주. 아직 시즌이 시작되지 않아 공격대 레이드나 쐐기 던전 같은 컨텐츠에 도전하지는 못했지만, 그 사이 정말 열심히 플레이했다. 시즌 오픈이 빨리 되기를 바란다. 이번 확장팩에서는 꼭 신화 레이드까지 클리어하고 싶다는 목표가 생겼다.\n\n## 국립중앙박물관\n\n오랜만에 국립중앙박물관을 방문했다. 지난번 방문이 약 10년 전이었나? 정확한 기억은 나지 않지만, 이번에 방문하니 정말 넓더라. 상설관 1층만 둘러봐도 2시간이 소요되었고, 배고픔과 다리 통증 이슈로 2·3층은 다음 기회로 미루기로 했다.\n\n방문객들이 정말 많았는데, 박물관이 리뉴얼되었다고 하더니 더 인기가 많아진 것 같다. 역사에는 좀 약한 편이지만, 옛날 유물들과 그에 대한 설명들을 통해 평소에 몰랐던 것들을 많이 배울 수 있는 좋은 경험이었다.\n"
      },
      {
        "type": "file",
        "name": "점심 산책길",
        "path": "01. Diary/점심 산책길.md",
        "date": "2026.03.15",
        "content": "오늘 점심을 먹고 김프로님이 산책을 한다길래 따라 갔다, 이제 날씨도 따뜻해지고 소화도 할겸 같이 걷자고 했다. 최근에 이집트 출장 가서 있었던 일, 주식이야기, 가족의 건강 이야기 등을 하면서 걸었다.\n"
      },
      {
        "type": "file",
        "name": "정말로 비전공자가 코딩 할 수 있는 세상이 되었다.",
        "path": "01. Diary/정말로 비전공자가 코딩 할 수 있는 세상이 되었다..md",
        "date": "2026.03.12",
        "content": "AI만 등에 업으면 뭐든지 할 수 있을 것 같다.\n블로그도 이렇게 원하는 대로 뚝딱 만들어준다.\n이제 뭐 방법을 모른다, 이런 변명은 통하지 않을 것 같다.\n\n진짜 내가 원하는 대로 만들 수 있는 블로그라니~\n인터넷은 점점 AI 쓰레기통이 되어가고 있다.\n\n인터넷이라는 드넓은 세계에 나만의 공간이 생긴 것 같다.\n\n공부 해야지..."
      }
    ]
  },
  {
    "type": "folder",
    "name": "이전 하루",
    "path": "이전 하루",
    "children": []
  },
  {
    "type": "file",
    "name": "나의 하루 03-16",
    "path": "나의 하루 03-16.md",
    "date": "2026.03.16",
    "content": "---\ndate: 2026-03-16\ntitle: 나의 하루\ndaily_goals:\npriority: \nmood: 😊\ntags:\n  - daily\n  - routine\n---\n\n## 일정표\ndate : 2026-03-16\n\n| 시간 | 계획 | 비고 |\n|------|------|------|\n| 06:00 ~ 07:00 |  |  - [x] |\n| 07:00 ~ 08:00 |  | - [ ] |\n| 08:00 ~ 09:00 |  | - [ ] |\n| 09:00 ~ 11:20 | 집중 업무 | - [ ] |\n| 11:20 ~ 12:20 | 점심 & 산책 | - [ ] |\n| 12:20 ~ 15:00 | 집중 업무  | - [ ] |\n| 15:00 ~ 15:30 | 휴식 | - [ ] |\n| 15:30 ~ 17:30 | 집중 업무 | - [ ] |\n| 18:00 ~ 19:30 | 잔업 | - [ ] |\n| 19:30 ~ 20:00 | 퇴근 | - [ ] |\n| 20:00 ~ 21:00 | 저녁 먹고 유튜브 | - [ ] |\n| 21:00 ~ 22:30 | 와우 | - [ ] |\n| 22:30 ~ 23:30 | 나를 개발 | - [ ] |\n| 23:00 ~ 24:00 | 양치 취침 | - [ ] |\n\n"
  },
  {
    "type": "file",
    "name": "Habit Tracker",
    "path": "Habit Tracker.md",
    "date": "2026.03.16",
    "content": "## 7시 이전 기상\n2026-03-15, \n\n## 24시 이전 취침\n2026-03-15, 2026-03-16\n\n## 듀오 링고\n2026-03-15, 2026-03-16\n\n## 운동 (아주 조금 이라도)\n2026-03-15\n"
  },
  {
    "type": "file",
    "name": "알 고 싶은 것",
    "path": "알 고 싶은 것.md",
    "date": "2026.03.15",
    "content": "MCP"
  }
];
