const BLOG_FILES = [
  {
    "type": "folder",
    "name": "01. Diary",
    "path": "01. Diary",
    "children": [
      {
        "type": "file",
        "name": "점심 산책길",
        "path": "01. Diary/점심 산책길.md",
        "date": "2026.03.23",
        "content": "2026-03-15\n오늘 점심을 먹고 김프로님이 산책을 한다길래 따라 갔다, 이제 날씨도 따뜻해지고 소화도 할겸 같이 걷자고 했다. 최근에 이집트 출장 가서 있었던 일, 주식이야기, 가족의 건강 이야기 등을 하면서 걸었다.\n\n2026-03-17\n오늘은 원래 산책을 하던 김프로님과 조프로님과 함께 산책을 했다, 패딩을 입고 산책하기 많이 더워서 내일부터 조금 얇은 옷을 입으려 했으나 내일 비 예보가 있어서 패딩을 입고 출근을 해야겠다, 조프로님이 도자기를 3개월 정도 배운적이 있었다고 한다. 그리고 조프로님만의 투자법과 월 배당 커버드콜 ETF에 관한 이야기와 리딩방 음모론 등 이야기 하면서 걸었다.\n\n2026-03-19\n오늘도 용프로님과 조프로님과의 산책을 했다. 잘 나가는 프로님들 이야기, 이란 전쟁 이야기, 경제적 자유, 봄 바람이 불어 집에 가고 싶은 이야기, 제주도 휴가 이야기 등을 하면서 걸었다.\n\n 2026-03-23\n 끝나지 않는 이란 전쟁, 종교를 맹신하는자의 위험, 고혈합, GWP 이야기를 하며 용프로님과 조프로님과 걸었다."
      },
      {
        "type": "file",
        "name": "주말 끝",
        "path": "01. Diary/주말 끝.md",
        "date": "2026.03.17",
        "content": "\n확장팩이 열린 지 어느덧 2주. 아직 시즌이 시작되지 않아 공격대 레이드나 쐐기 던전 같은 컨텐츠에 도전하지는 못했지만, 그 사이 정말 열심히 플레이했다. 시즌 오픈이 빨리 되기를 바란다. 이번 확장팩에서는 꼭 신화 레이드까지 클리어하고 싶다는 목표가 생겼다.\n\n오랜만에 국립중앙박물관을 방문했다. 지난번 방문이 약 10년 전이었나? 정확한 기억은 나지 않지만, 이번에 방문하니 정말 넓더라. 상설관 1층만 둘러봐도 2시간이 소요되었고, 배고픔과 다리 통증 이슈로 2·3층은 다음 기회로 미루기로 했다.\n\n방문객들이 정말 많았는데, 박물관이 리뉴얼되었다고 하더니 더 인기가 많아진 것 같다. 역사에는 좀 약한 편이지만, 옛날 유물들과 그에 대한 설명들을 통해 평소에 몰랐던 것들을 많이 배울 수 있는 좋은 경험이었다.\n"
      },
      {
        "type": "file",
        "name": "정말로 비전공자가 코딩 할 수 있는 세상이 되었다.",
        "path": "01. Diary/정말로 비전공자가 코딩 할 수 있는 세상이 되었다..md",
        "date": "2026.03.12",
        "content": "AI만 등에 업으면 뭐든지 할 수 있을 것 같다.\n블로그도 이렇게 원하는 대로 뚝딱 만들어준다.\n이제 뭐 방법을 모른다, 이런 변명은 통하지 않을 것 같다.\n\n진짜 내가 원하는 대로 만들 수 있는 블로그라니~\n인터넷은 점점 AI 쓰레기통이 되어가고 있다.\n\n인터넷이라는 드넓은 세계에 나만의 공간이 생긴 것 같다.\n\n공부 해야지..."
      }
    ]
  },
  {
    "type": "file",
    "name": "나의 하루",
    "path": "나의 하루.md",
    "date": "2026.03.24",
    "content": "---\ndate: 2026-03-16\ntitle: 나의 하루\ndaily_goals:\npriority: \nmood: 😊\ntags:\n  - daily\n  - routine\n---\n\n## 일정과 할일\n\n##### date : 2026-03-24\n\n| 시간 | 계획 | 비고 |\n|------|------|------|\n| 07:00 ~ 08:00 | 기상 출근 | - [] |\n| 08:00 ~ 11:20 | 집중 업무 | - [] |\n| 11:20 ~ 12:20 | 점심 산책 | - [] |\n| 12:20 ~ 18:30 | 집중 업무 | - [] |\n| 18:30 ~ 20:00 | 운동! | - [] |\n| 20:00 ~ 20:30 | 나의 하루를 정리 | - [] |\n\n\n- [ ] (Pending)  ■■■ ■■ ■■ ■■ ■■ ■■■ ■■ \n\t- [ ] (브라질)전류 이상 값 확인\n- [ ]  ■■■ ■■■ \n- [ ] 구미 출장 협의\n\n##### date : 2026-03-24\n- [ ] (Pending)  ■■■ ■■ ■■ ■■ ■■ ■■■ ■■ \n\t- [ ] (브라질)전류 이상 값 확인\n\n- [x] (Working)(구미) EAS .NET 호환 버전\n\t- [x] 오늘 17시 이후에 테스트\n\n\n- [ ] (Pending)  ■■ ■■■  업무 협의\n\t- [ ]  ■■■ ■■ ■■■ ■■\n\n\n\n##### date : 2026-03-23\n\n\n\n- [x] (Pending)(광주) 별도 검사 기능 추가\n\t- [x] 불량 재검사 로직\n\t- [x] 불량 데이터 생성\n\t- [x] 기타....(옵셋 등..)\n\t- [x] 테스트 필요\n\n\n\n##### date : 2026-03-19\n\n| 시간 | 계획 | 비고 |\n|------|------|------|\n| 07:00 ~ 08:10 | 기상 출근 | - [x] |\n| 08:10 ~ 09:00 | 주간 업무 자료 작성 | - [x] |\n| 09:00 ~ 10:00 | 집중 업무 | - [x] |\n| 10:00 ~ 11:00 | 주간 업무 | - [x] |\n| 11:00 ~ 11:20 | 멍 때리기 | - [x] |\n| 11:20 ~ 12:30 | 점심, 산책 | - [x] |\n| 12:30 ~ 15:00 | 집중 업무 | - [x] |\n| 15:00 ~ 16:30 | 전략 공유회 | - [x] |\n| 16:30 ~ 16:50 | 업무 보고 | - [x] |\n| 16:50 ~ 18:30 | 집중 업무 | - [x] |\n| 18:30 ~ 20:30 | 운동 | - [x] |\n| 20:30 ~ 21:30 | 저녁 티비 | - [x] |\n| 21:30 ~ 22:30 | 나의 하루를 정리 | - [x] |\n| 22:30 ~ 27:00 | 와우 레이드 (일반) | - [x] |\n\n- [ ] (Working)  ■■■ ■■ ■■ ■■ ■■ ■■■ ■■ \n\t- [x] (브라질) DB 정보 업데이트\n\t- [ ] (브라질) 마스터 모듈 통합 관리 프로그램 테스트\n\t\t- [x] (delay) 통합 관리 기능 문제... 디버깅\n\t\t\t- [x] 네트워크에 부하가 많이 생긴다.\n\t\t\t- [x] 기존에 쓰던 방식에서 개선이 필요하다.\n\t- [ ] (브라질)전류 이상 값 확인\n- [ ] (pending)(구미) EAS .NET 호환 버전\n- [ ] (pending)(광주) 별도 검사 기능 추가\n\t- [ ]  ■■ ■■■ ■■■■■ ■■■■■ ■■\n- [ ] (pending)  ■■ ■■■  업무 협의\n\n---\n##### date : 2026-03-17\n\n| 시간 | 계획 | 비고 |\n|------|------|------|\n| 07:00 ~ 08:00 | 기상 출근 | - [x] |\n| 08:00 ~ 08:30 | 커피 한잔, 하루 시작 | - [x] |\n| 08:30 ~ 11:20 | 집중 업무 | - [x] |\n| 11:20 ~ 12:20 | 점심, 산책 | - [x] |\n| 12:20 ~ 15:00 | 집중 업무 | - [x] |\n| 15:00 ~ 16:00 | 요소기술 전시회 | 바빠서 못감 포기 |\n| 17:30 ~ 18:30 | 주간 업무 내용 정리 | - [x] |\n| 18:30 ~ 20:30 | 운동! | 야근함.. |\n| 20:30 ~ 22:00 | 독서 or 공부 | - [나는 다시 삶을 선택했다.] |\n| 22:00 ~ 22:30 | 나의 하루를 정리 | - [x] |\n| 22:30 ~ 23:30 | 취침 | - [x] |\n\n#### TODO\n\n할일이 점점 쌓이는데..? 빨리 쳐내야지\n\n- [x] 번개 정산 (■■■ ■■■■■■■원\n- [ ] (Working)  ■■■ ■■ ■■ ■■ ■■ ■■■ ■■ \n\t- [x] (브라질) DB 정보 업데이트\n\t- [ ] (브라질) 마스터 모듈 통합 관리 프로그램 테스트\n\t\t- [x] (delay) 통합 관리 기능 문제... 디버깅\n\t\t\t- [x] 네트워크에 부하가 많이 생긴다.\n\t\t\t- [x] 기존에 쓰던 방식에서 개선이 필요하다.\n\t- [ ] (브라질)전류 이상 값 확인\n- [ ] (pending)(구미) EAS .NET 호환 버전\n- [ ] (pending)(광주) 별도 검사 기능 추가\n\t- [ ]  ■■ ■■■ ■■■■■ ■■■■■ ■■\n - [x] ! (important)주간 업무 정리\n - [x] ! (important)  ■■■■ ■■ ■■  현황, ■■ ■■■■ ■■ ■■ ■■■ ■■■■  현재 상황 포함)\n---\n\n###### date : 2026-03-17\n\n| 시간 | 계획 | 비고 |\n|------|------|------|\n| 07:30 ~ 08:30 | 기상 출근 |  - [x] |\n| 08:30 ~ 11:20 | 집중 업무(EAS, 브라질) | - [x] |\n| 11:20 ~ 12:20 | 점심, 산책, 커피 | - [x] |\n| 12:20 ~ 14:00 | 집중 업무 | - [x] |\n| 14:20 ~ 15:20 | ~~요소기술 전시회~~ | 바빠서 못감.. |\n| 15:20 ~ 17:30 | 집중 업무  | - [x] |\n| 17:30 ~ 20:00 | 번개 | - [x] |\n| 20:00 ~ 21:00 | 나의 하루를 정리 | - [x] |\n| 21:00 ~ 22:10 | 공부 | - [x]  |\n| 22:10 ~ 23:00 | 와우 | - [x] |\n| 23:00 ~ 24:00 | 취침 | - [x]  |\n\n#### Todo \n- [ ]  ■■■ ■■ ■■ ■■ ■■ ■■■ ■■ \n\t- [x] (브라질)DB 정보 업데이트\n\t- [ ] (브라질)마스터 모듈 통합 관리 프로그램 테스트\n\t\t- [ ] (delay) 통합 관리 기능 문제... 디버깅\n\t\t\t- [ ] 네트워크에 부하가 많이 생긴다.\n\t\t\t- [ ] 기존에 쓰던 방식에서 개선이 필요하다.\n\t- [ ] (delay)(브라질)전류 이상 값 확인\n- [ ] (pending)(구미) EAS .NET 호환 버전\n- [ ] (pending)(광주) 별도 검사 기능 추가\n- [x] 자료 취합\\\n\n---\n\n###### date : 2026-03-16\n\n| 시간 | 계획 | 비고 |\n|------|------|------|\n| 06:00 ~ 07:00 |  |  - [x] |\n| 07:00 ~ 08:00 |  | - [x] |\n| 08:00 ~ 09:00 |  | - [x] |\n| 09:00 ~ 11:20 | 집중 업무 | - [x] |\n| 11:20 ~ 12:20 | 점심 & 산책 | - [x] |\n| 12:20 ~ 15:00 | 집중 업무  | - [x] |\n| 15:00 ~ 15:30 | 휴식 | - [x] |\n| 15:30 ~ 17:30 | 집중 업무 | - [x] |\n| 18:00 ~ 19:30 | 잔업 | - [x] |\n| 19:30 ~ 20:00 | 퇴근 | - [x] |\n| 20:00 ~ 21:00 | 저녁 먹고 유튜브 | - [x] |\n| 21:00 ~ 22:30 | 와우 | - [x] |\n| 22:30 ~ 23:30 | 나를 개발 | - [x] |\n| 23:00 ~ 24:00 | 양치 취침 | - [x] |\n\n\n\n\n\n\n\n| 시간 | 계획 | 비고 |\n|------|------|------|\n| 06:00 ~ 07:00 |  | - [] |\n| 07:00 ~ 08:00 |  | - [] |\n| 08:00 ~ 09:00 |  | - [] |\n| 09:00 ~ 11:20 |  | - [] |\n| 11:20 ~ 12:20 |  | - [] |\n| 12:20 ~ 15:00 |  | - [] |\n| 15:00 ~ 15:30 |  | - [] |\n| 15:30 ~ 17:30 |  | - [] |\n| 18:00 ~ 19:30 |  | - [] |\n| 19:30 ~ 20:00 |  | - [] |\n| 20:00 ~ 21:00 |  | - [] |\n| 21:00 ~ 22:30 |  | - [] |\n| 22:30 ~ 23:30 |  | - [] |\n| 23:00 ~ 24:00 |  | - [] |"
  },
  {
    "type": "file",
    "name": "Habit Tracker",
    "path": "Habit Tracker.md",
    "date": "2026.03.24",
    "content": "## 7시 이전 기상\n2026-03-15, \n\n## 24시 이전 취침\n2026-03-15, 2026-03-16\n\n## 듀오 링고\n2026-03-15, 2026-03-16, 2026-03-17, 2026-03-18, 2026-03-19, 2026-03-20, 2026-03-21, 2026-03-22, 2026-03-24\n\n## 운동 (아주 조금 이라도)\n2026-03-15, 2026-03-21, 2026-03-20, 2026-03-19\n"
  },
  {
    "type": "file",
    "name": "todo",
    "path": "todo.md",
    "date": "2026.03.23",
    "content": "Modbus-RTU over TCP/IP Protocal\n"
  },
  {
    "type": "file",
    "name": "무제 1",
    "path": "무제 1.md",
    "date": "2026.03.23",
    "content": "VLM, RAG, MULTI AGENT, FDC, 데이터레이크, "
  },
  {
    "type": "file",
    "name": "나의 일본 여행",
    "path": "나의 일본 여행.md",
    "date": "2026.03.23",
    "content": "1. ~~F1 티켓~~\n2. ~~항공 티켓~~\n3. ~~QR ~~\n4. 공항에서 나고야역 어디서 내리는 거지?\n5. 나고야역에서 스즈카 어케 가지?\n6. 나고야역에서 숙소 어케 가지?"
  },
  {
    "type": "file",
    "name": "무제",
    "path": "무제.md",
    "date": "2026.03.20",
    "content": "![[Pasted image 20260320132645.png]]"
  }
];
